[
  {
    "id": "koan:mu",
    "source": "koan",
    "title": "Joshu's Dog",
    "text": "A monk asked Joshu, \"Does a dog have Buddha nature or not?\" Joshu answered: \"Mu!\"",
    "ref": "Gateless Gate #1",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:wash-your-bowl",
    "source": "koan",
    "title": "Wash Your Bowl",
    "text": "A monk told Joshu: \"I have just entered the monastery. Please teach me.\" Joshu asked: \"Have you eaten your rice porridge?\" The monk replied: \"I have eaten.\" Joshu said: \"Then you had better wash your bowl.\"",
    "ref": "Gateless Gate #7",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:ordinary-mind",
    "source": "koan",
    "title": "Ordinary Mind is the Way",
    "text": "Joshu asked Nansen, \"What is the Way?\" Nansen answered: \"Ordinary mind is the Way.\" Joshu asked: \"Should I try to direct myself toward it?\" Nansen said: \"If you try to turn toward it, you go against it.\"",
    "ref": "Gateless Gate #19",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:not-wind-not-flag",
    "source": "koan",
    "title": "Not the Wind, Not the Flag",
    "text": "Two monks were arguing about a flag. One said: \"The flag is moving.\" The other said: \"The wind is moving.\" The sixth patriarch happened to be passing by. He told them: \"Not the wind, not the flag; mind is moving.\"",
    "ref": "Gateless Gate #29",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:three-pounds-flax",
    "source": "koan",
    "title": "Three Pounds of Flax",
    "text": "A monk asked Tozan, \"What is Buddha?\" Tozan said: \"Three pounds of flax.\"",
    "ref": "Gateless Gate #18",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:oak-tree-in-garden",
    "source": "koan",
    "title": "The Oak Tree in the Garden",
    "text": "A monk asked Joshu, \"What is the meaning of Bodhidharma's coming from the West?\" Joshu said, \"The oak tree in the garden.\"",
    "ref": "Gateless Gate #37",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:nansen-kills-cat",
    "source": "koan",
    "title": "Nansen Cuts the Cat in Two",
    "text": "Nansen saw the monks of the eastern and western halls fighting over a cat. He seized the cat and said: \"If any of you say a good word, you can save the cat.\" No one answered. So Nansen cut the cat in two. That evening Joshu returned and Nansen told him about this. Joshu removed his sandals and, placing them on his head, walked out. Nansen said: \"If you had been there, you could have saved the cat.\"",
    "ref": "Gateless Gate #14",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:guteis-finger",
    "source": "koan",
    "title": "Gutei's Finger",
    "text": "Gutei raised his finger whenever he was asked a question about Zen. A boy attendant began to imitate him in this way. When anyone asked the boy what his master had preached about, the boy would raise his finger. Gutei heard about the boy's mischief. He seized him and cut off his finger. The boy cried and ran away. Gutei called to him. When the boy turned his head to Gutei, Gutei raised up his own finger. In that instant the boy was enlightened.",
    "ref": "Gateless Gate #3",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:sound-of-one-hand",
    "source": "koan",
    "title": "The Sound of One Hand",
    "text": "The master said to his young student: \"You can hear the sound of two hands when they clap together. Now show me the sound of one hand.\"",
    "ref": "Zen Tradition",
    "attribution": "Hakuin Ekaku"
  },
  {
    "id": "koan:no-water-no-moon",
    "source": "koan",
    "title": "No Water, No Moon",
    "text": "When the nun Chiyono studied Zen under Bukko, she was unable to attain enlightenment for a long time. At last one moonlit night she was carrying water in an old pail bound with bamboo. The bamboo broke and the bottom fell out of the pail, and at that moment Chiyono was set free! She wrote: \"In this way and that I tried to save the old pail. Bamboo strips holding it together, then suddenly the bottom fell out. No more water in the pail! No more moon in the water!\"",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  },
  {
    "id": "koan:everything-is-best",
    "source": "koan",
    "title": "Everything is Best",
    "text": "When Banzan was walking through a market he overheard a conversation between a butcher and his customer. \"Give me the best piece of meat you have,\" said the customer. \"Everything in my shop is the best,\" replied the butcher. \"You cannot find here any piece of meat that is not the best.\" At these words Banzan became enlightened.",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  },
  {
    "id": "koan:empty-your-cup",
    "source": "koan",
    "title": "A Cup of Tea",
    "text": "A university professor came to visit a Zen master. While the master served tea, the professor talked about Zen. The master poured the tea into the visitor's cup until it was full, and then kept pouring. The professor watched the overflow until he could no longer restrain himself. \"It is overfull. No more will go in!\" \"Like this cup,\" the master said, \"you are full of your own opinions and speculations. How can I show you Zen unless you first empty your cup?\"",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  },
  {
    "id": "koan:the-moon-cannot-be-stolen",
    "source": "koan",
    "title": "The Moon Cannot Be Stolen",
    "text": "Ryokan, a Zen master, lived the simplest kind of life in a little hut at the foot of a mountain. One evening a thief visited the hut only to discover there was nothing to steal. Ryokan returned and caught him. \"You have come a long way to visit me,\" he told the prowler, \"and you should not return empty-handed. Please take my clothes as a gift.\" The thief was bewildered. He took the clothes and slunk away. Ryokan sat naked, watching the moon. \"Poor fellow,\" he mused, \"I wish I could have given him this beautiful moon.\"",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  },
  {
    "id": "koan:bells-and-robes",
    "source": "koan",
    "title": "Bells and Robes",
    "text": "A monk asked Ummon, \"What is Buddha?\" Ummon answered: \"A dried shit-stick.\"",
    "ref": "Gateless Gate #21",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:the-gateless-gate",
    "source": "koan",
    "title": "The Gateless Gate",
    "text": "For the pursuit of Zen, you must pass through the barriers set up by the Zen masters. To attain the mysterious awareness one must completely uproot all the normal workings of one's mind. If you do not pass through the barriers, whatever you do and whatever you think is a tangle of ghost. Now what are the barriers? This one word \"Mu\" is the sole barrier. This is why it is called the Gateless Gate of Zen.",
    "ref": "Gateless Gate Preface",
    "attribution": "Wumen Huikai"
  },
  {
    "id": "koan:original-face",
    "source": "koan",
    "title": "Your Original Face",
    "text": "The Master asked: \"Show me your original face, the face you had before your parents were born.\"",
    "ref": "Zen Tradition",
    "attribution": "Huineng"
  },
  {
    "id": "koan:single-hair",
    "source": "koan",
    "title": "A Single Hair",
    "text": "Whenever Baso was asked about the deepest meaning of Zen, he would strike the questioner. Once a monk asked, \"What is the meaning of Bodhidharma's coming from the West?\" Baso gave him a slap and said, \"If I do not strike you, people all over the country will laugh at me.\"",
    "ref": "Zen Tradition",
    "attribution": "Baso"
  },
  {
    "id": "koan:true-refuge",
    "source": "koan",
    "title": "The True Refuge",
    "text": "A student said to Master Ichu, \"Please write for me something of great wisdom.\" Master Ichu picked up his brush and wrote one word: \"Attention.\" The student said, \"Is that all?\" The master wrote, \"Attention. Attention.\" The student became irritable. \"That doesn't seem profound or subtle to me.\" In response, Master Ichu wrote simply: \"Attention. Attention. Attention.\" In frustration, the student demanded, \"What does this word 'Attention' mean?\" Master Ichu replied, \"Attention means attention.\"",
    "ref": "Zen Tradition",
    "attribution": "Master Ichu"
  },
  {
    "id": "koan:the-stingy-artist",
    "source": "koan",
    "title": "The Taste of Banzo's Sword",
    "text": "Matajuro wanted to become a great swordsman, but his father said he wasn't quick enough and could never learn. So Matajuro went to the famous dueler Banzo and asked to become his pupil. \"How long will it take me to become a master?\" he asked. \"Suppose I become your servant, to be with you every minute; how long?\" \"Ten years,\" said Banzo. \"My father is getting old. Before ten years have passed I will have to return home to take care of him. Suppose I work twice as hard; how long will it take me?\" \"Thirty years,\" said Banzo. \"How is that?\" asked Matajuro. \"When you are in too much of a hurry, you will take even longer,\" explained Banzo.",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  },
  {
    "id": "koan:the-tunnel",
    "source": "koan",
    "title": "The Tunnel",
    "text": "Zenkai, the son of a samurai, journeyed to Edo and there became the retainer of a high official. He fell in love with the official's wife and was discovered. In self-defense, he slew the official. Then he ran away with the wife. Both of them later became thieves. But the woman was so greedy that Zenkai grew disgusted. Finally, leaving her, he journeyed far away to a province where he became a wandering mendicant. To atone for his past, Zenkai resolved to accomplish some good deed in his lifetime. Knowing of a dangerous road over a cliff that had caused the death and injury of many persons, he resolved to cut a tunnel through the mountain. Begging food in the daytime, Zenkai worked at night digging the tunnel. When thirty years had gone by, the tunnel was 2,280 feet long, 20 feet high, and 30 feet wide. Two years before the work was completed, the son of the official he had slain found Zenkai and came to kill him in revenge. \"I will give you my life willingly,\" said Zenkai. \"Only let me finish this work. On the day it is completed, then you may kill me.\" So the son awaited the day. Several months passed and Zenkai kept on digging. The son grew tired of doing nothing and began to help with the digging. After he had helped for more than a year, he came to admire Zenkai's strong will and character. At last the tunnel was completed and the people could use it and travel in safety. \"Now cut off my head,\" said Zenkai. \"The way you have lived these thirty years,\" said the man, \"that is the life of a Buddha. How can I cut off my own teacher's head?\"",
    "ref": "101 Zen Stories",
    "attribution": "Zen Tradition"
  }
]
